Data/TestFiles/cases/Ayyash_250/case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

deltaT          1;

endTime         2000;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  15;

runTimeModifiable true;

libs
(
    // Needed for availability of porous baffle boundary in potentialFoam
    #include "turbulenceLib"
);

functions
{
    ReportingFunction
    {
        type                forces;
        libs                ("libforces.so");
        log                 true;

        patches             ( wall );
        p                   p;
        U                   U;
        rho                 rhoInf;
        rhoInf              1.2;
        pRef                10000.0;
        porosity            false;
        writeFields         true;
        CofR                ( 0.0 0.0 2.95 );

        binData
        {
            nBin            1;
            direction       ( 0.0 0.0 1.0 );
            cumulative      true;
        }
    }

    ReportingFunction001
    {
        type                forceCoeffs;
        libs                ("libforces.so");
        log                 true;

        patches             ( wall );
        p                   p;
        U                   U;
        rho                 rhoInf;
        rhoInf              1.2;
        pRef                10000.0;
        porosity            false;
        writeFields         true;
        CofR                ( 0.0 0.0 2.95 );
        liftDir             ( 1.0 0.0 0.0 );
        dragDir             ( 0.0 0.0 1.0 );
        pitchAxis           ( 0.0 -1.0 0.0 );

        magUInf             80.0;

        lRef                5.9;
        Aref                0.32306;

        binData
        {
            nBin            1;
            direction       ( 0.0 0.0 1.0 );
            cumulative      true;
        }
    }

}

// ************************************************************************* //
